{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "PENN LIBRARIES UNITED",
	"language": "en",
	"home_page_url": "https://example.com/",
	"feed_url": "https://example.com/feed/feed.json",
	"description": "The unionization effort at Penn Libraries",
	"author": {
		"name": "Penn Libraries United",
		"url": ""
	},
	"items": [
		{
			"id": "https://example.com/blog/secondpost/",
			"url": "https://example.com/blog/secondpost/",
			"title": "Penn Libraries United files to unionize!",
			"content_html": "<p>We are very excited to share that, with support from a supermajority of our colleagues, <strong>we just filed our petition for union representation with the National Labor Relations Board and notified our Director of our intent to unionize.</strong> This means we are officially “public” with our union campaign!</p>\n<p>Forming a union will make Penn Libraries stronger. It will empower staff to build a safe, inclusive workplace free from discrimination and harassment. A union of, by, and for the workers of Penn Libraries will help reduce turnover, improve job satisfaction, and give voice to underrepresented workers in organizational decision-making, strengthening the Libraries in profound ways.</p>\n<p>A supermajority of professional staff have signed union authorization cards, meaning we can finally win a union that represents ALL union-eligible staff at the Libraries. The issues that have been shared throughout the campaign unify all Libraries staff and together we will finally have the strength to enact real change.</p>\n<p>We are looking forward to joining our already unionized colleagues in AFSCME DC47 Local 590. We would not have reached this point without their support, the guidance of other unionized (and unionizing) academic library workers, and the efforts of everyone who has signed on to support the union.</p>\n<h2 id=\"what-happens-next\" tabindex=\"-1\">What happens next? <a class=\"header-anchor\" href=\"https://example.com/blog/secondpost/\">#</a></h2>\n<p>This morning, we notified Penn of our intent to unionize and requested voluntary recognition of our union. Voluntary recognition means that Penn respects our authorization cards filed with the NLRB as evidence we want to unionize, instead of requiring an election. If Penn voluntarily recognizes us, that means we can move more quickly into contract negotiations. If they don’t, we will proceed to an election where we will vote to unionize and then proceed to negotiations.</p>\n<h2 id=\"what-can-you-do\" tabindex=\"-1\">What can you do? <a class=\"header-anchor\" href=\"https://example.com/blog/secondpost/\">#</a></h2>\n<p>Follow and share our social media posts! Please tell your friends and family to follow us. The more people see our effort, the more power we have!</p>\n<ul>\n<li>Twitter: <a href=\"https://twitter.com/pennlibunited\">@pennlibunited</a></li>\n<li>Instagram: <a href=\"https://instagram.com/pennlibrariesunited\">@pennlibrariesunited</a></li>\n</ul>\n<p>Watch this space for updates as we move forward into a new and exciting chapter in the history of the Penn Libraries.</p>\n",
			"date_published": "2024-06-21T00:00:00Z"
		}
		,
		{
			"id": "https://example.com/blog/firstpost/",
			"url": "https://example.com/blog/firstpost/",
			"title": "Press release",
			"content_html": "<p>On June 21, 2024, librarians, curators, developers, and other staff at the Penn Libraries delivered a letter to the Vice Provost/Director of the Penn Libraries announcing that they are unionizing as Penn Libraries United (PLU). The letter informed the Director that a supermajority of eligible library staff have signed union representation cards. The group intends to join the same union local as their colleagues in the Penn Libraries support staff, who have been unionized since 1969 as AFSCME District Council 47 Local 590.</p>\n<p>Structural issues motivating the unionization effort are longstanding. PLU members cite unclear promotion procedures, inequitable raises, lack of transparency in decision-making, and an overreliance on term-limited positions as motivators for employees organizing.</p>\n<p>Heather Hughes, a Penn librarian and member of PLU, adds: “Since I’ve started at the Libraries, I’ve seen a lot of colleagues leave. I want the Libraries to be a place where workers feel empowered and people feel like they can stay and grow.”</p>\n<p>Yvonne Harris, a longtime member of the Penn Libraries support staff and President of Local 590, welcomes her colleagues: “The intention was always for Local 590 to represent all union-eligible staff at the Libraries. By unionizing and joining us, our library coworkers will finally realize that vision. We could not be more excited.”</p>\n<p>In addition to Local 590, AFSCME District Council 47 represents cultural workers at the Free Library of Philadelphia, the Penn Museum, the Philadelphia Museum of Art, the Please Touch Museum, and the Philadelphia Zoo. April Gigetts, President of AFSCME DC47, says of the announcement: “We are proud to stand with these Penn Libraries workers and other cultural workers organizing across Philadelphia.”</p>\n<p>PLU is the latest in a wave of new labor organizing at Penn. Since 2021, Penn Museum workers, Resident Assistants, Hospital Residents and Fellows, and Graduate Workers have all unionized, dramatically increasing union density at the University. These new unions have joined together with existing union locals on campus, including AFSCME 590, to form the Coalition of Workers at Penn, in affiliation with the Philadelphia Council AFL-CIO. Daniel Bauder, Philly AFL-CIO President, says of the PLU announcement: “The Philadelphia Council AFL-CIO and Coalition of Workers at Penn are thrilled to support these library workers and all other Penn workers in joining the labor movement. Fighting to improve wages and working conditions there is important to all of us.”</p>\n",
			"date_published": "2024-06-21T00:00:00Z"
		}
		
	]
}
